#!/usr/bin/python3
# -*- coding: utf-8 -*-

# 百鸡百钱
#   规则: 公鸡一只5元，母鸡一只3元，小鸡三只1元
#   结果: 100元买一百只鸡
#   问题: 公鸡、母鸡和小鸡各多少只。
#
#   解法：
#       x,y,z 分别为公鸡、母鸡、小鸡
#       x < 20, y < 33 z < 333
#
#       5x + 3y + z/3 = 100
#       x + y + z = 100
#       x >= 0 && x < 20
#       y >= 0 && y < 33
#       z >= 0 && z < 333
#       
#   可以采用暴力穷举法:
#   数学上也可以使用动态规划。
#

def chicken100():
    for x in range(0, 20):
        for y in range(0, 33):
            z = 100 - x - y
            if 5 * x + 3 * y + z / 3 == 100:
                print("公鸡、母鸡、小鸡分别为: %d, %d, %d" % (x, y, z))

chicken100()

